{
  "name": "248 Hobsonville Point Road",
  "description": "1944: \n\n- The viewpoint is looking east-north-east from the eastern platform at Como Station.\n\n- The Georges River height is at about mid-tide.\n\n- At right rear can be seen Murphy's private Pleasure Grounds with rotunda & flag mast at the lookout.\n\n- At right foreground are two schoolboys (messing around?)\n\n- The Murphy brothers' Tea Rooms & Refreshments (aka \"Como Cafe\") building is in the centre, with their assorted boatsheds situated behind it (the boatshed(s) / hall at left are ex - W.C. Press & Sons' floating shed & function hall).\n\n- Three little girls are sitting in the shadows on the grass area between the two pathways from the station.\n\n- Legible signs include \"Como Pleasure Grounds\"; two \"This Way To Murphy's Shed - BOATS for HIRE - Weekdays (?), Sundays (?), Dinghies (?), Holidays Double Rates\" signs; \"Grand Social Concert - In Aid of Como Cot Fund\"; \"COMO GENERAL STORE - REFRESHMENTS, DINING and TEA ROOMS\"; \"Warrington's Photographic\"; \"Under New Management - W.S. BIRKS - Great Reduction In Prices\"; two \"BOATS FOR HIRE\" signs on the boatsheds.\n\n2023: \n\n- The viewpoint is still east-north-east from the renewed eastern platform at Como Station, now equipped with digital signages and eco-friendly lighting.\n\n- The Georges River appears more vibrant, guided by smart tide management systems ensuring optimum water levels throughout the year.\n\n- To the right rear, what was once Murphy's private Pleasure Grounds has now been transformed into a public heritage park, the restored rotunda & flag mast at the lookout stand as testament to the past.\n\n- On the right foreground, the sculpture of two schoolboys serves as a tribute to the lighthearted mischief of bygone days.\n\n- The Murphy brothers' Tea Rooms & Refreshments, now popularly known as the \"Como Cafe\", stands in the centre as an adaptive reuse masterpiece, blending old-world charm with modern conveniences. The historic boatsheds at its rear have been converted into a museum, showcasing the rich maritime history of the region (the boatshed(s) / hall at left are restored versions of W.C. Press & Sons' floating shed & function hall).\n\n- In the midst of the bustling pathway from the station, a mural featuring three little girls sitting on the grass recalls the simpler times of the original photograph.\n\n- Legible digital signages include \"Como Pleasure Grounds\", \"This Way To Historic Boat Museum - Open on Weekdays, Sundays, Holidays\"; \"Grand Social Concerts - In Aid of Como Community Fund\"; \"COMO GENERAL STORE - REFRESHMENTS, DINING, and TEA ROOMS - Now Serving Vegan and Gluten-Free Options\"; \"Warrington's Photographic Exhibition\"; \"Sustainable Management - W.S. BIRKS - Promoting Eco-Friendly Practices\"; \"BOATS FOR HIRE - Now Offering Eco-Paddle Boats and Kayaks\".",
  "b_imageUrl": "/posts/1000-248-hobsonville-point-road/b1-900x900.jpg",
  "a_imageUrl": "/posts/1000-248-hobsonville-point-road/a1-900x900.jpg",
  "ba_imageUrl": "/posts/1000-248-hobsonville-point-road/ba1-900x900.jpg",
  "w": 900,
  "h": 900,
  "slug": "248-hobsonville-point-road"
}
